# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

day_number = int(input())
if day_number <= 5 > 0:
    print('нет')
elif day_number < 7 > 6:
    print ('да')
elif day_number > 7: 
    print('are you seriously?!?')